content/posts/The_end_of_objectivity_by_Gian-Carlo_Rota_in_1973.md
+++
title = "The end of objectivity by Gian-Carlo Rota in 1973"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:36:11-04:00
slug = "The_end_of_objectivity_by_Gian-Carlo_Rota_in_1973"
draft = false
+++

## [philosophy]({{< relref "philosophy" >}}) {#philosophy--philosophy-dot-md}


## Contents {#contents}


### 1  Introduction {#1-introduction}


### 2  The Two Philosophies {#2-the-two-philosophies}

<!--list-separator-->

-  2.1    The existential attitude:  a critique of physicalist reduction

<!--list-separator-->

-  2.2    The consequences of the existential view:  a new objectivity


### 3  The Reform of Logic {#3-the-reform-of-logic}

<!--list-separator-->

-  3.1    The existential critique of knowledge as primary

<!--list-separator-->

-  3.3    The reform of logic:  Heidegger

<!--list-separator-->

-  3.2    The Cartesian world view has cracked


### 4  Heidegger and the Shaking of the Foundations {#4-heidegger-and-the-shaking-of-the-foundations}

<!--list-separator-->

-  4.1    Review

    <!--list-separator-->

    -  4.1.1 Acts of withholding

<!--list-separator-->

-  4.2    Existentialism’s thesis

<!--list-separator-->

-  4.3    Heidegger’s reform of logic

<!--list-separator-->

-  4.4    Operational logic made primary

<!--list-separator-->

-  4.5    The structure of operational logic

<!--list-separator-->

-  4.6    The consequences of operational logic

<!--list-separator-->

-  4.7    Truth and angst illustrate the relations of classical logic to operational logic
